In [1]:
import pandas as pd
import numpy as np

In [3]:
from numpy.random import randn as rn
md=rn(5,4)
md

array([[ 1.3315865 ,  0.71527897, -1.54540029, -0.00838385],
       [ 0.62133597, -0.72008556,  0.26551159,  0.10854853],
       [ 0.00429143, -0.17460021,  0.43302619,  1.20303737],
       [-0.96506567,  1.02827408,  0.22863013,  0.44513761],
       [-1.13660221,  0.13513688,  1.484537  , -1.07980489]])

##### Note this md data keeps on changing everytime we excetute the command, Suppose we want to fix the data than we have
##### to use SEED option

In [4]:
np.random.seed(10)
md=rn(5,4)
md

array([[ 1.3315865 ,  0.71527897, -1.54540029, -0.00838385],
       [ 0.62133597, -0.72008556,  0.26551159,  0.10854853],
       [ 0.00429143, -0.17460021,  0.43302619,  1.20303737],
       [-0.96506567,  1.02827408,  0.22863013,  0.44513761],
       [-1.13660221,  0.13513688,  1.484537  , -1.07980489]])

## If any other machine also if we use seed(10) we get same data

### converting this to DataFRame

In [5]:
pd.DataFrame(md)

          0         1         2         3
0  1.331587  0.715279 -1.545400 -0.008384
1  0.621336 -0.720086  0.265512  0.108549
2  0.004291 -0.174600  0.433026  1.203037
3 -0.965066  1.028274  0.228630  0.445138
4 -1.136602  0.135137  1.484537 -1.079805

### Now if we want to assign column and index label to the dataset above

In [6]:
row_label=["A","B","C","D","E"]
col_label=["W","X","Y","Z"]
df=pd.DataFrame(md,index=row_label,columns=col_label)
df

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [7]:
df1=pd.DataFrame(md,row_label,col_label)
df1

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

## extract row 2

In [8]:
df.iloc[2]

W    0.004291
X   -0.174600
Y    0.433026
Z    1.203037
Name: C, dtype: float64

## Extract col x and Y

In [15]:
df.iloc[:,[1,2]]

          X         Y
A  0.715279 -1.545400
B -0.720086  0.265512
C -0.174600  0.433026
D  1.028274  0.228630
E  0.135137  1.484537

In [9]:
df[["X","Y"]]

          X         Y
A  0.715279 -1.545400
B -0.720086  0.265512
C -0.174600  0.433026
D  1.028274  0.228630
E  0.135137  1.484537

# LOC(LOCATION)

#### If we want to extract row using index labels then we use "LOC"

In [10]:
df.loc["A":"B"]

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549

In [11]:
df.loc[["A","B"]]

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549

In [12]:
df.loc["B":"D"]

          W         X         Y         Z
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138

In [17]:
df.loc["C":"A"]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [16]:
df.loc["D":"A"]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [21]:
df.loc[["A","B","C"],"X"]

A    0.715279
B   -0.720086
C   -0.174600
Name: X, dtype: float64

In [28]:
df.iloc[0,2]

-1.5454002921112682

In [23]:
df.iloc[0],[2]

(W    1.331587
 X    0.715279
 Y   -1.545400
 Z   -0.008384
 Name: A, dtype: float64,
 [2])

In [16]:
df.iloc[0:2]

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549

In [17]:
df[["Y","Z"]].iloc[0:2]

          Y         Z
A -1.545400 -0.008384
B  0.265512  0.108549

In [30]:
df.iloc[0:2,2:]

          Y         Z
A -1.545400 -0.008384
B  0.265512  0.108549

In [39]:
df.loc["A":"B","Y":"Z"]

          Y         Z
A -1.545400 -0.008384
B  0.265512  0.108549

In [18]:
df.iloc[0],df.iloc[1]

(W    1.331587
 X    0.715279
 Y   -1.545400
 Z   -0.008384
 Name: A, dtype: float64,
 W    0.621336
 X   -0.720086
 Y    0.265512
 Z    0.108549
 Name: B, dtype: float64)

### What if we change row index to integer will iloc take it as it is integr location

In [19]:
df1=pd.DataFrame(md,[10,20,30,40,50],col_label)
df1

           W         X         Y         Z
10  1.331587  0.715279 -1.545400 -0.008384
20  0.621336 -0.720086  0.265512  0.108549
30  0.004291 -0.174600  0.433026  1.203037
40 -0.965066  1.028274  0.228630  0.445138
50 -1.136602  0.135137  1.484537 -1.079805

In [20]:
df1.iloc[10]

IndexError: single positional indexer is out-of-bounds

In [21]:
df1.loc[10]

W    1.331587
X    0.715279
Y   -1.545400
Z   -0.008384
Name: 10, dtype: float64

In [22]:
df1.loc[[10,20]]

           W         X         Y         Z
10  1.331587  0.715279 -1.545400 -0.008384
20  0.621336 -0.720086  0.265512  0.108549

##### it proved iloc take default index i.e [0,1,2,3,4 and so on]

## What if we have duplicate index

In [43]:
df1=pd.DataFrame(md,[10,20,30,30,50],col_label)
df1

           W         X         Y         Z
10  1.331587  0.715279 -1.545400 -0.008384
20  0.621336 -0.720086  0.265512  0.108549
30  0.004291 -0.174600  0.433026  1.203037
30 -0.965066  1.028274  0.228630  0.445138
50 -1.136602  0.135137  1.484537 -1.079805

In [44]:
df1.loc[30]

           W         X         Y         Z
30  0.004291 -0.174600  0.433026  1.203037
30 -0.965066  1.028274  0.228630  0.445138

#### It extract both

##### Extract:-
##### w           y
##### 0.621336	-0.265512
##### 0.004291	-0.433026

In [45]:
df1

           W         X         Y         Z
10  1.331587  0.715279 -1.545400 -0.008384
20  0.621336 -0.720086  0.265512  0.108549
30  0.004291 -0.174600  0.433026  1.203037
30 -0.965066  1.028274  0.228630  0.445138
50 -1.136602  0.135137  1.484537 -1.079805

In [46]:
df1.iloc[1:3,[0,2]]

           W         Y
20  0.621336  0.265512
30  0.004291  0.433026

In [47]:
df1.loc[[20,30],["W","Y"]]

           W         Y
20  0.621336  0.265512
30  0.004291  0.433026
30 -0.965066  0.228630

In [51]:
df1.iloc[[4,0,1]]

           W         X         Y         Z
50 -1.136602  0.135137  1.484537 -1.079805
10  1.331587  0.715279 -1.545400 -0.008384
20  0.621336 -0.720086  0.265512  0.108549

In [50]:
df1.loc[[50,10,20]]

           W         X         Y         Z
50 -1.136602  0.135137  1.484537 -1.079805
10  1.331587  0.715279 -1.545400 -0.008384
20  0.621336 -0.720086  0.265512  0.108549

# Row and column combination

In [28]:
df.iloc[[4,1,2],[1]]
# Basically (4,1,2) represent row and (1) represent column

          X
E  0.135137
B -0.720086
C -0.174600

In [29]:
# extraxt
#   X          Y
# 0.720086	0.265512
# -0.174600	0.433026
df.iloc[1:3,1:3]

# we dont pass [1:3,1:3] in list as we are not passing multiple element like [[1,2,3]]

          X         Y
B -0.720086  0.265512
C -0.174600  0.433026

In [30]:
# Using LOc
df.loc["A":"B","X":"Y"]

          X         Y
A  0.715279 -1.545400
B -0.720086  0.265512

In [ ]:
# Extract 
# 1.331587  0.008384
# 1.136602  1.079805

In [52]:
df

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [31]:
df.loc[["A","E"],["W","Z"]]

          W         Z
A  1.331587 -0.008384
E -1.136602 -1.079805

In [32]:
df.iloc[[0,4],[0,3]]

          W         Z
A  1.331587 -0.008384
E -1.136602 -1.079805

In [ ]:
# USing Loc extract 
#   W          X          Y
# 0.621336	-0.720086	0.265512
# 0.004291	-0.174600	0.433026
# 0.965066	1.028274	0.228630
# without using individual index vales

In [33]:
df.loc["B":"D","W":"Y"]

          W         X         Y
B  0.621336 -0.720086  0.265512
C  0.004291 -0.174600  0.433026
D -0.965066  1.028274  0.228630

In [34]:
# Creating new column and adding X and Y
df["New column X+Y"]=df["X"]+df["Y"]
df

          W         X         Y         Z  New column X+Y
A  1.331587  0.715279 -1.545400 -0.008384       -0.830121
B  0.621336 -0.720086  0.265512  0.108549       -0.454574
C  0.004291 -0.174600  0.433026  1.203037        0.258426
D -0.965066  1.028274  0.228630  0.445138        1.256904
E -1.136602  0.135137  1.484537 -1.079805        1.619674

### Dropping rows

In [35]:
df.drop("E")
# By default axis=0 i.e rows to del it permamntly use inplace=True

          W         X         Y         Z  New column X+Y
A  1.331587  0.715279 -1.545400 -0.008384       -0.830121
B  0.621336 -0.720086  0.265512  0.108549       -0.454574
C  0.004291 -0.174600  0.433026  1.203037        0.258426
D -0.965066  1.028274  0.228630  0.445138        1.256904

In [36]:
# We can use reassing ment operation as weell to del row permamntly
df=df.drop("New column X+Y",axis=1)
df

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

# Condition Based Operations

In [37]:
df

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [38]:
print(df>0)

       W      X      Y      Z
A   True   True  False  False
B   True  False   True   True
C   True  False   True   True
D  False   True   True   True
E  False   True   True  False

In [39]:
# Basic Filter
print(df["A":"C"]>0)

      W      X      Y      Z
A  True   True  False  False
B  True  False   True   True
C  True  False   True   True

In [40]:
# Filter in dataFrame
df[df["A":"C"]>0]

          W         X         Y         Z
A  1.331587  0.715279       NaN       NaN
B  0.621336       NaN  0.265512  0.108549
C  0.004291       NaN  0.433026  1.203037
D       NaN       NaN       NaN       NaN
E       NaN       NaN       NaN       NaN

### With New Data

In [53]:
md=np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
md

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [54]:
df=pd.DataFrame(md,["A","B","C","D","E"],["Age","Weight","Height"])
df

   Age  Weight  Height
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [56]:
df>65

     Age  Weight  Height
A  False    True    True
B  False    True    True
C  False   False    True
D  False    True    True
E  False   False    True

In [59]:
df[df>65]

   Age  Weight  Height
A  NaN    66.0     140
B  NaN    70.0     148
C  NaN     NaN     125
D  NaN    68.0     160
E  NaN     NaN     152

In [43]:
# Select Weight >65
df[df["Weight"]>65]
# it wil give full recored

   Age  Weight  Height
A   22      66     140
B   42      70     148
D   35      68     160

In [44]:
# if we do 
df["Weight"]>65

A     True
B     True
C    False
D     True
E    False
Name: Weight, dtype: bool

In [45]:
df[(df["Weight"]>65) & (df["Height"]>140) | (df["Age"]>25)]

   Age  Weight  Height
B   42      70     148
C   30      62     125
D   35      68     160

In [46]:
# We can=t use and or it throw error as sjown below
df[(df["Weight"]>65) and (df["Height"]>140)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

# Reset Index

In [47]:
df.reset_index()

  index  Age  Weight  Height
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

### note it add a new column Index

In [59]:
# to remove index column we use drop
df.reset_index(drop=True,inplace=True)

In [60]:
df

   Age  Weight  Height
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

## Set Index

In [61]:
df["xyz"]="Student Teacher Engineer Doctor Nurse".split()
df

   Age  Weight  Height       xyz
0   22      66     140   Student
1   42      70     148   Teacher
2   30      62     125  Engineer
3   35      68     160    Doctor
4   25      62     152     Nurse

In [62]:
df.set_index("xyz")

          Age  Weight  Height
xyz
Student    22      66     140
Teacher    42      70     148
Engineer   30      62     125
Doctor     35      68     160
Nurse      25      62     152

##### In this wway we can use any column as Indexes

#### Note here

In [64]:
"-"*45

'---------------------------------------------'

# Multi Indexing

In [62]:
outside=["G1","G1","G1","G2","G2","G2"]
inside=[1,2,3,1,2,3]
h_index=list(zip(outside,inside))
h_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [63]:
print("Tuple pair after Zip Command\n","-"*45)
print(h_index)

Tuple pair after Zip Command
 ---------------------------------------------
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [64]:
h_index=pd.MultiIndex.from_tuples(h_index)
print("\n Index Hierachry \n","-"*45)
print(h_index)

 Index Hierachry
 ---------------------------------------------
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [69]:
# Its type is Multi Ndex
type(h_index)

pandas.core.indexes.multi.MultiIndex

### Creating data using Multi Index

In [65]:
np.random.seed(10)
dta=np.random.randn(6,3)
dta=pd.DataFrame(np.round(dta),index=h_index,columns=["A","B","C"])
dta

        A    B    C
G1 1  1.0  1.0 -2.0
   2 -0.0  1.0 -1.0
   3  0.0  0.0  0.0
G2 1 -0.0  0.0  1.0
   2 -1.0  1.0  0.0
   3  0.0 -1.0  0.0

### Note in here Index G1 belongs to [1,2,3] similarly G2. So ad5ress of -1 is G1 of 2 and clumn "C"

In [66]:
# if we do
dta.loc["G1"]

     A    B    C
1  1.0  1.0 -2.0
2 -0.0  1.0 -1.0
3  0.0  0.0  0.0

In [99]:
dta.loc["G1"].iloc[1,2]

-1.0

In [103]:
# Extract 0.0	0.0 from g1--3--col [B,C]
dta.loc["G1"].loc[3,"B":"C"]

B    0.0
C    0.0
Name: 3, dtype: float64

In [67]:
dta

        A    B    C
G1 1  1.0  1.0 -2.0
   2 -0.0  1.0 -1.0
   3  0.0  0.0  0.0
G2 1 -0.0  0.0  1.0
   2 -1.0  1.0  0.0
   3  0.0 -1.0  0.0

In [72]:
dta.iloc[[2,3]]

        A    B    C
G1 3  0.0  0.0  0.0
G2 1 -0.0  0.0  1.0

In [86]:
dta.loc[["G1","G2"]].iloc[[2,3],[1,2]]

        B    C
G1 3  0.0  0.0
G2 1  0.0  1.0

In [112]:
# Extract 0.0	0.0
#          0.0	1.0

dta.loc[["G1","G2"]].iloc[[2,3],1:3]

        B    C
G1 3  0.0  0.0
G2 1  0.0  1.0

# Ques

In [122]:
l1=["A","A","A","B","B","B","C","C","C"]
l2=[1,2,3,1,2,3,1,2,3]
l3=[1,2,3,4,5,6,7,8,9]

dt=list(zip(l1,l2,l3))
dt

[('A', 1, 1),
 ('A', 2, 2),
 ('A', 3, 3),
 ('B', 1, 4),
 ('B', 2, 5),
 ('B', 3, 6),
 ('C', 1, 7),
 ('C', 2, 8),
 ('C', 3, 9)]

In [124]:

n_indx=pd.MultiIndex.from_tuples(dt)

dt1=pd.DataFrame(np.round(np.random.randn(9,4)),index=n_indx,columns=["A","B","C","D"])
print("\n Index Hierachry \n","-"*45)
dt1

 Index Hierachry
 ---------------------------------------------

         A    B    C    D
A 1 1  0.0  0.0 -0.0 -1.0
  2 2 -1.0  0.0  1.0 -1.0
  3 3  1.0  0.0 -1.0  0.0
B 1 4  1.0  0.0  2.0  0.0
  2 5  1.0  0.0  1.0 -2.0
  3 6 -1.0 -0.0  1.0  0.0
C 1 7  1.0  0.0  0.0 -0.0
  2 8  0.0  1.0  1.0  1.0
  3 9 -0.0 -1.0 -0.0  0.0

# Dropping Missing Values

In [129]:
# Consider dataset
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df['States']="CA NV AZ".split()
df.set_index('States',inplace=True)
df

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

## Using Dropna

In [132]:
# Dropping Null values from rows
print(df.dropna(axis=0))

          A    B  C
States
CA      1.0  5.0  1

In [134]:
print(df.dropna(axis=1))

        C
States
CA      1
NV      2
AZ      3

##### notice it is deleting full roww or col even if there is a single Nan Value

# Threshold-
##### Returns how many non NaN we allow, Suppose if define thresh=2 then it looks for 2 Non NaN values

In [136]:
df.dropna(axis=0,thresh=2)

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2

In [140]:
df.dropna(axis=0,thresh=1)

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

In [149]:
# Consider dataset
df2 = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3],"D":[np.nan,np.nan,np.nan]})
df2['States']="CA NV AZ".split()

df2.set_index('States',inplace=True)
df2

          A    B  C   D
States
CA      1.0  5.0  1 NaN
NV      2.0  NaN  2 NaN
AZ      NaN  NaN  3 NaN

In [150]:
df2.dropna(axis=1,thresh=1)

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

In [151]:
df2.dropna(axis=0,thresh=3)

          A    B  C   D
States
CA      1.0  5.0  1 NaN